kateloop/453-project/PIC18/code/main.c
    // Turn on ADC and enable interrupts
   // ADON = 1;
   // ADC_INT_ENABLE();

        // UART config
        SPBRGH  = SPBRGH_SPBRG >> 8;
        SPBRG =  SPBRGH_SPBRG;
        BAUDCON = 0b00001000;
        RCSTA = 0b10010000;
        TXSTA = 0b00100000;

        LATB = 0b00000000;

     //   while (1)
     //   {
     //       ToggleLeds();
   //      LATB = 0b00000000;
   //       DelayMs(20);
  //         TXREG = 'a';
   //        while ((PIR1 & 0b00010000) ==0);
        //  LATB = 0b00100000;
        //   DelayMs(20);

         /*   while ((PIR1 & 0b00100000) == 0) {
                LATB = 0b00100000;
                DelayMs(20);
                LATB = 0b00000000;
                DelayMs(20);
            }
*/
           //while ((PIR1 & 0b00100000) == 0);
      //    if (RCREG == 'a') {
      //          LATB = 0b00100000;
      //          DelayMs(20);
      //          LATB = 0b00000000;
      //          DelayMs(20);
      //      }
            
  //      }
        /*while (1) {
            unsigned char tx = 'a';
             WriteUSART(tx);
        }*/

          /*   while (1) {
                LATC = 0b01000000;
                DelayMs(20);
                LATC = 0b00000000;
                DelayMs(20);
             }*/
    

        

      /*  while (!RCIF) {
            LATB = 0b00000000;
             DelayMs(20);
             LATB = 0b00100000;
             DelayMs(20);
        }
        unsigned char rv;
        rv = ReadUSART();
*/
      //  while (rv == tx) {
      //      continue;
      //  }
    


    while (0) {
        // once receive data on the uart, stuff into led array
        ToggleLeds();

        // wait until sensor value changes and send out on uart
        while (change_val == 0) {
            // spin
            continue;
        }
        int result = cur_inputs[index];
        char channel = index; // 0 == A, 6 == G
        // TODO send result and channel across UART
        
    }
        
        ToggleLeds();
        /*
// Enabled by 0
#define A_SEL_PORTC  0b00000100    // pin 13, RC2
#define B_SEL_PORTC  0b00001000    // pin 14, RC3
#define C_SEL_PORTA  0b00010000    // pin 6, RA4
#define D_SEL_PORTA  0b01000000    // pin 10, RA6
#define E_SEL_PORTC  0b00000001    // pin 11, RC0
#define F_SEL_PORTC  0b00000010    // pin 12, RC1
#define G_SEL_PORTB  0b11101001    // pin 28, RB7

// Enabled by 1
#define L3_SEL_PORTB 0b00111111    // pin 27, RB6
#define R3_SEL_PORTB 0b01011111    // pin 26, RB5
#define L4_SEL_PORTB 0b01110111    // pin 24, RB3
#define R4_SEL_PORTB 0b01111110    // pin 21, RB2
#define L5_SEL_PORTC 0b11011111    // pin 16, RC5
#define R5_SEL_PORTC 0b11101111    // pin 15, RC4*/




  //  return (EXIT_SUCCESS);
}


//////////////////////////////////////////////
//  Function to Toggle LEDs according to    //
//  notes being played.                     //
//////////////////////////////////////////////

// N channels enabled by 1
// P channels enabled by 0
void ToggleLeds () {

    // Look at array containing LED Info and toggle LEDs accordingly

    // Octave 3
    if (led_array[4] == 1 && led_array[5] == 1 && led_array[6] == 1) {
        // Octave 3 L & R LED on; C
        //FIXME 3G L&R also turns on...
        //LATA   -P-P----
        LATA = 0b11101111;
        //LATB   PNN-NN--
        LATB = 0b1110000;
        //LATB   --NNPPPP
        LATC = 0b00000111;
    } else if (led_array[4] == 1 && led_array[5] == 1 && led_array[7] == 1) {
        // Octave 3 L & R LED on; D
        //LATA   -P-P----
        LATA = 0b10111111;
        //LATB   PNN-NN--
        LATB = 0b11100000;
        //LATB   --NNPPPP
        LATC = 0b00001111;
    } else if (led_array[4] == 1 && led_array[5] == 1 && led_array[8] == 1) {
        // Octave 3 L & R LED on; E
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b11100000;
        //LATB   --NNPPPP
        LATC = 0b00001110;     
    } else if (led_array[4] == 1 && led_array[5] == 1 && led_array[9] == 1) {
        // Octave 3 L & R LED on; F
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b11100000;
        //LATB   --NNPPPP
        LATC = 0b00001101;
    } else if (led_array[4] == 1 && led_array[5] == 1 && led_array[10] == 1) {
        // Octave 3 L & R LED on; G
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b01100000;
        //LATB   --NNPPPP
        LATC = 0b00001111;
    } else if (led_array[4] == 1 && led_array[5] == 1 && led_array[11] == 1) {
        // Octave 3 L & R LED on; A
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b11100000;
        //LATB   --NNPPPP
        LATC = 0b00001011;
    } else if (led_array[4] == 1 && led_array[5] == 1 && led_array[12] == 1) {
       // Octave 5 3 & R LED on; B
       //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b11100000;
        //LATB   --NNPPPP
        LATC = 0b00000111;

    } else if (led_array[4] == 1 && led_array[6] == 1) {
        // Octave 3 Right LED is on; C
        //LATA   -P-P----
        LATA = 0b11101111;
        //LATB   PNN-NN--
        LATB = 0b1100000;
        //LATB   --NNPPPP
        LATC = 0b00001111;
    } else if (led_array[4] == 1 && led_array[7] == 1) {
        // Octave 3 Right LED is on; D
        //LATA   -P-P----
        LATA = 0b10111111;
        //LATB   PNN-NN--
        LATB = 0b1100000;
        //LATB   --NNPPPP
        LATC = 0b00001111;
    } else if (led_array[4] == 1 && led_array[8] == 1) {
        // Octave 3 Right LED is on; E
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b1100000;
        //LATB   --NNPPPP
        LATC = 0b00001110;
    } else if (led_array[4] == 1 && led_array[9] == 1) {
        // Octave 3 Right LED is on; F
        //LATA   -P-P----
        LATA = 0b11111101;
        //LATB   PNN-NN--
        LATB = 0b1100000;
        //LATB   --NNPPPP
        LATC = 0b00001101;
        
