kateloop/453-project/PIC18/code/main.c
    } else if (led_array[4] == 1 && led_array[10] == 1) {
        // Octave 3 Right LED is on; G
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b0100000;
        //LATB   --NNPPPP
        LATC = 0b00001111;
        
    } else if (led_array[4] == 1 && led_array[11] == 1) {
        // Octave 3 Right LED is on; A
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b1100000;
        //LATB   --NNPPPP
        LATC = 0b00001011;
        
    } else if (led_array[4] == 1 && led_array[12] == 1) {
        // Octave 3 Right LED is on; B
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b1100000;
        //LATB   --NNPPPP
        LATC = 0b00000111;
        
    } else if (led_array[5] == 1 && led_array[6] == 1) {
        // Octave 3 Left LED is on; C
        //LATA   -P-P----
        LATA = 0b11101111;
        //LATB   PNN-NN--
        LATB = 0b1010000;
        //LATB   --NNPPPP
        LATC = 0b00001111;
        
    } else if (led_array[5] == 1 && led_array[7] == 1) {
        // Octave 3 Left LED is on; D
        //LATA   -P-P----
        LATA = 0b10111111;
        //LATB   PNN-NN--
        LATB = 0b1010000;
        //LATB   --NNPPPP
        LATC = 0b00001111;

    } else if (led_array[5] == 1 && led_array[8] == 1) {
        // Octave 3 Left LED is on; E
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b1010000;
        //LATB   --NNPPPP
        LATC = 0b00001110;

    } else if (led_array[5] == 1 && led_array[9] == 1) {
        // Octave 3 Left LED is on; F
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b1010000;
        //LATB   --NNPPPP
        LATC = 0b00001101;

    } else if (led_array[5] == 1 && led_array[10] == 1) {
        // Octave 3 Left LED is on; G
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b0010000;
        //LATB   --NNPPPP
        LATC = 0b00001111;

    } else if (led_array[5] == 1 && led_array[11] == 1) {
        // Octave 3 Left LED is on; A
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b1010000;
        //LATB   --NNPPPP
        LATC = 0b00001011;

    } else if (led_array[5] == 1 && led_array[12] == 1) {
        // Octave 3 Left LED is on; B
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b1010000;
        //LATB   --NNPPPP
        LATC = 0b00000111;
    }
    
    // Octave 4
    else if (led_array[2] == 1 && led_array[3] == 1 && led_array[6] == 1) {
        // Octave 4 L & R LED on; C
        //LATA   -P-P----
        LATA = 0b11101111;
        //LATB   PNN-NN--
        LATB = 0b10001100;
        //LATB   --NNPPPP
        LATC = 0b00001111;

    } else if (led_array[2] == 1 && led_array[3] == 1 && led_array[7] == 1) {
        // Octave 4 L & R LED on; D
        //LATA   -P-P----
        LATA = 0b10111111;
        //LATB   PNN-NN--
        LATB = 0b10001100;
        //LATB   --NNPPPP
        LATC = 0b00001111;

    } else if (led_array[2] == 1 && led_array[3] == 1 && led_array[8] == 1) {
        // Octave 4 L & R LED on; E
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b10001100;
        //LATB   --NNPPPP
        LATC = 0b00001110;

    } else if (led_array[2] == 1 && led_array[3] == 1 && led_array[9] == 1) {
        // Octave 4 L & R LED on; F
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b10001100;
        //LATB   --NNPPPP
        LATC = 0b00001101;
    } else if (led_array[2] == 1 && led_array[3] == 1 && led_array[10] == 1) {
        // Octave 4 L & R LED on; G
        //LATA   -P-P----
        LATA = 0b01111111;
        //LATB   PNN-NN--
        LATB = 0b10001100;
        //LATB   --NNPPPP
        LATC = 0b00001111;
    } else if (led_array[2] == 1 && led_array[3] == 1 && led_array[11] == 1) {
        // Octave 4 L & R LED on; A
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b10001100;
        //LATB   --NNPPPP
        LATC = 0b00001011;
    } else if (led_array[2] == 1 && led_array[3] == 1 && led_array[12] == 1) {
       // Octave 4 L & R LED on; B
       //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b10001100;
        //LATB   --NNPPPP
        LATC = 0b00000111;
    } else if (led_array[2] == 1 && led_array[6] == 1) {
        // Octave 4 Right LED is on; C
        //LATA   -P-P----
        LATA = 0b11101111;
        //LATB   PNN-NN--
        LATB = 0b10000100;
        //LATB   --NNPPPP
        LATC = 0b00001111;
        
    } else if (led_array[2] == 1 && led_array[7] == 1) {
        // Octave 4 Right LED is on; D
        //LATA   -P-P----
        LATA = 0b10111111;
        //LATB   PNN-NN--
        LATB = 0b10000100;
        //LATB   --NNPPPP
        LATC = 0b00001111;
        
    } else if (led_array[2] == 1 && led_array[8] == 1) {
        // Octave 4 Right LED is on; E
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b10000100;
        //LATB   --NNPPPP
        LATC = 0b00001110;
        
    } else if (led_array[2] == 1 && led_array[9] == 1) {
        // Octave 4 Right LED is on; F
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b10000100;
        //LATB   --NNPPPP
        LATC = 0b00001101;
        
    } else if (led_array[2] == 1 && led_array[10] == 1) {
        // Octave 4 Right LED is on; G
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b00000100;
        //LATB   --NNPPPP
        LATC = 0b00001111;
        
    } else if (led_array[2] == 1 && led_array[11] == 1) {
        // Octave 4 Right LED is on; A
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b10000100;
        //LATB   --NNPPPP
        LATC = 0b00001011;
        
    } else if (led_array[2] == 1 && led_array[12] == 1) {
        // Octave 4 Right LED is on; B
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b10000100;
        //LATB   --NNPPPP
        LATC = 0b00000111;
        
    } else if (led_array[3] == 1 && led_array[6] == 1) {
        // Octave 4 Left LED is on; C
        //LATA   -P-P----
        LATA = 0b11101111;
        //LATB   PNN-NN--
        LATB = 0b10001000;
        //LATB   --NNPPPP
        LATC = 0b00001111;
        
    } else if (led_array[3] == 1 && led_array[7] == 1) {
        // Octave 4 Left LED is on; D
        //LATA   -P-P----
        LATA = 0b10111111;
        //LATB   PNN-NN--
        LATB = 0b10001000;
        //LATB   --NNPPPP
        LATC = 0b00001111;

    } else if (led_array[3] == 1 && led_array[8] == 1) {
        // Octave 4 Left LED is on; E
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b10001000;
        //LATB   --NNPPPP
        LATC = 0b00001110;

