kateloop/453-project/PIC18/code/main.c
}

/*
 * Does an ADC conversion
 */
/*void adc_conversion (int adc_channel) {

    ADC_INT_DISABLE (); // disable interrupts
    
    // ADIE = 0;  // Mask interrupt
     //ADIF = 0;  // Reset ADC interrupt bit
    
    // Reenable interrupts
    ADC_INT_ENABLE();
}*/


// ISR that processes ADC data from 7 inputs in a sequential fashion

ISR () {
    // TODO Disable Interrupts

    adc_conversion ();

    cur_inputs[conv_result.adc_channel] = conv_result.result;

    if (cur_inputs[conv_result.adc_channel] != prev_inputs[conv_result.adc_channel]) {
        change_val = 1;
        prev_inputs[conv_result.adc_channel] = cur_inputs[conv_result.adc_channel];
        index = conv_result.adc_channel;
    } else {
        change_val = 0;
    }

    // TODO Reenable Interrupts
    
}


//////////////////////////////////////////////
// Function that processes ADC data from    //
// 7 inputs in a sequential fashion         //
//////////////////////////////////////////////

void adc_conversion() {

    ADON = 0;   // Turn off ADC

    ADRESH = 0; // reset result registers
    ADRESL = 0;

    // set ADCON0 register, start conversion, write result in new
    switch (adc_num) {
        case ADCCHANA :
            ADCON0 = ADCON0_CHANA;
            break;
        case ADCCHANB :
            ADCON0 = ADCON0_CHANB;
            break;
        case ADCCHANC :
            ADCON0 = ADCON0_CHANC;
            break;
        case ADCCHAND :
            ADCON0 = ADCON0_CHAND;
            break;
        case ADCCHANE :
            ADCON0 = ADCON0_CHANE;
            break;
        case ADCCHANF :
            ADCON0 = ADCON0_CHANF;
            break;
        case ADCCHANG :
            ADCON0 = ADCON0_CHANG;
            break;
    }


    // Start conversion and wait for result
    ADON = 1;   // Turn on ADC
    GODONE = 1; // Starts conversion

    // Wait for conversion to finish
    while (GODONE) {
        ADON = 0;
    }

    // store conversion result
    conv_result.result = ADRES;
    conv_result.adc_channel = adc_num;

    // Increase the number of the ADC for next conversion
    adc_num++;
    if (adc_num >= NUMADCCHAN) {
        adc_num = ADCCHANA;
    }
}

